tiborsimon/embedded-tdd-headers/pic/8bit/pic16f914_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F914_H_
#define _PIC16F914_H_

#define STATUS                        0
#define C                             1
#define CARRY                         2
#define DC                            3
#define ZERO                          4
#define Z                             5
#define nPD                           6
#define nTO                           7
#define RP0                           8
#define RP                            9
#define RP1                           10
#define IRP                           11
#define PORTA                         12
#define RA0                           13
#define RA1                           14
#define RA2                           15
#define RA3                           16
#define RA4                           17
#define RA5                           18
#define RA6                           19
#define RA7                           20
#define PORTB                         21
#define RB0                           22
#define RB1                           23
#define RB2                           24
#define RB3                           25
#define RB4                           26
#define RB5                           27
#define RB6                           28
#define RB7                           29
#define PORTC                         30
#define RC0                           31
#define RC1                           32
#define RC2                           33
#define RC3                           34
#define RC4                           35
#define RC5                           36
#define RC6                           37
#define RC7                           38
#define PORTD                         39
#define RD0                           40
#define RD1                           41
#define RD2                           42
#define RD3                           43
#define RD4                           44
#define RD5                           45
#define RD6                           46
#define RD7                           47
#define PORTE                         48
#define RE0                           49
#define RE1                           50
#define RE2                           51
#define RE3                           52
#define INTCON                        53
#define RBIF                          54
#define INTF                          55
#define T0IF                          56
#define TMR0IF                        57
#define RBIE                          58
#define INTE                          59
#define T0IE                          60
#define TMR0IE                        61
#define PEIE                          62
#define GIE                           63
#define PIR1                          64
#define TMR1IF                        65
#define TMR2IF                        66
#define CCP1IF                        67
#define SSPIF                         68
#define TXIF                          69
#define RCIF                          70
#define ADIF                          71
#define EEIF                          72
#define PIR2                          73
#define CCP2IF                        74
#define LVDIF                         75
#define LCDIF                         76
#define C1IF                          77
#define C2IF                          78
#define OSFIF                         79
#define T1CON                         80
#define TMR1ON                        81
#define TMR1CS                        82
#define T1SYNC                        83
#define T1INSYNC                      84
#define nT1SYNC                       85
#define T1OSCEN                       86
#define T1CKPS0                       87
#define T1CKPS                        88
#define T1CKPS1                       89
#define T1GE                          90
#define TMR1GE                        91
#define T1GINV                        92
#define T2CON                         93
#define T2CKPS0                       94
#define T2CKPS                        95
#define T2CKPS1                       96
#define TMR2ON                        97
#define TOUTPS0                       98
#define TOUTPS                        99
#define TOUTPS1                       100
#define TOUTPS2                       101
#define TOUTPS3                       102
#define SSPCON                        103
#define SSPM0                         104
#define SSPM                          105
#define SSPM1                         106
#define SSPM2                         107
#define SSPM3                         108
#define CKP                           109
#define SSPEN                         110
#define SSPOV                         111
#define WCOL                          112
#define CCP1CON                       113
#define CCP1M0                        114
#define CCP1M                         115
#define CCP1M1                        116
#define CCP1M2                        117
#define CCP1M3                        118
#define CCP1Y                         119
#define CCP1X                         120
#define RCSTA                         121
#define RCD8                          122
#define RX9D                          123
#define OERR                          124
#define FERR                          125
#define ADDEN                         126
#define CREN                          127
#define SREN                          128
#define RC8_9                         129
#define RC9                           130
#define RX9                           131
#define nRC8                          132
#define SPEN                          133
#define CCP2CON                       134
#define CCP2M                         135
#define CCP2M0                        136
#define CCP2M1                        137
#define CCP2M2                        138
#define CCP2M3                        139
#define CCP2Y                         140
#define CCP2X                         141
#define ADCON0                        142
#define ADON                          143
#define nDONE                         144
#define GO_nDONE                      145
#define GO_DONE                       146
#define GO                            147
#define CHS                           148
#define CHS0                          149
#define CHS1                          150
#define CHS2                          151
#define VCFG                          152
#define VCFG0                         153
#define VCFG1                         154
#define ADFM                          155
#define OPTION_REG                    156
#define PS                            157
#define PS0                           158
#define PS1                           159
#define PS2                           160
#define PSA                           161
#define T0SE                          162
#define T0CS                          163
#define INTEDG                        164
#define nRBPU                         165
#define TRISA                         166
#define TRISA0                        167
#define TRISA1                        168
#define TRISA2                        169
#define TRISA3                        170
#define TRISA4                        171
#define TRISA5                        172
#define TRISA6                        173
#define TRISA7                        174
#define TRISB                         175
#define TRISB0                        176
#define TRISB1                        177
#define TRISB2                        178
#define TRISB3                        179
#define TRISB4                        180
#define TRISB5                        181
#define TRISB6                        182
#define TRISB7                        183
#define TRISC                         184
#define TRISC0                        185
#define TRISC1                        186
#define TRISC2                        187
#define TRISC3                        188
#define TRISC4                        189
#define TRISC5                        190
#define TRISC6                        191
#define TRISC7                        192
#define TRISD                         193
#define TRISD0                        194
#define TRISD1                        195
#define TRISD2                        196
#define TRISD3                        197
#define TRISD4                        198
#define TRISD5                        199
#define TRISD6                        200
#define TRISD7                        201
#define TRISE                         202
#define TRISE0                        203
#define TRISE1                        204
#define TRISE2                        205
#define TRISE3                        206
#define PIE1                          207
#define TMR1IE                        208
#define TMR2IE                        209
#define CCP1IE                        210
#define SSPIE                         211
#define TXIE                          212
#define RCIE                          213
#define ADIE                          214
#define EEIE                          215
#define PIE2                          216
#define CCP2IE                        217
#define LVDIE                         218
#define LCDIE                         219
#define C1IE                          220
#define C2IE                          221
#define OSFIE                         222
#define PCON                          223
#define nBOR                          224
#define nBO                           225
#define nPOR                          226
#define SBOREN                        227
#define OSCCON                        228
#define SCS                           229
#define LTS                           230
#define HTS                           231
#define OSTS                          232
#define IRCF                          233
#define IRCF0                         234
#define IRCF1                         235
#define IRCF2                         236
#define OSCTUNE                       237
#define TUN0                          238
#define TUN                           239
#define TUN1                          240
#define TUN2                          241
#define TUN3                          242
#define TUN4                          243
#define ANSEL                         244
#define ANS0                          245
#define AN                            246
#define AN0                           247
#define ANS1                          248
#define AN1                           249
#define ANS2                          250
#define AN2                           251
#define ANS3                          252
#define AN3                           253
#define ANS4                          254
#define AN4                           255
#define ANS5                          256
#define AN5                           257
#define ANS6                          258
#define AN6                           259
#define AN7                           260
#define ANS7                          261
#define SSPSTAT                       262
#define BF                            263
#define UA                            264
#define R_nW                          265
#define READ_WRITE                    266
#define I2C_READ                      267
#define nW                            268
#define R                             269
#define nWRITE                        270
#define R_W                           271
#define S                             272
#define I2C_START                     273
#define I2C_STOP                      274
#define P                             275
#define nA                            276
#define D_A                           277
#define D_nA                          278
#define D                             279
#define DATA_ADDRESS                  280
#define nADDRESS                      281
#define I2C_DATA                      282
#define CKE                           283
#define SMP                           284
#define WPUB0                         285
#define WPU0                          286
#define WPUB                          287
#define WPUB1                         288
#define WPU1                          289
#define WPUB2                         290
#define WPU2                          291
#define WPUB3                         292
#define WPU3                          293
#define WPUB4                         294
#define WPU4                          295
#define WPUB5                         296
#define WPU5                          297
#define WPUB6                         298
#define WPU6                          299
#define WPUB7                         300
#define WPU7                          301
#define IOCB4                         302
#define IOC4                          303
#define IOCB                          304
#define IOC5                          305
#define IOCB5                         306
#define IOC6                          307
#define IOCB6                         308
#define IOC7                          309
#define IOCB7                         310
#define CMCON1                        311
#define C2SYNC                        312
#define T1GSS                         313
#define TXSTA                         314
#define TXD8                          315
#define TX9D                          316
#define TRMT                          317
#define BRGH                          318
#define SYNC                          319
#define TXEN                          320
#define TX8_9                         321
#define TX9                           322
#define nTX8                          323
#define CSRC                          324
#define CMCON0                        325
#define CM                            326
#define CM0                           327
#define CM1                           328
#define CM2                           329
#define CIS                           330
#define C1INV                         331
#define C2INV                         332
#define C1OUT                         333
#define C2OUT                         334
#define VRCON                         335
#define VR0                           336
#define VR                            337
#define VR1                           338
#define VR2                           339
#define VR3                           340
#define VRR                           341
#define VREN                          342
#define ADCON1                        343
#define ADCS                          344
#define ADCS0                         345
#define ADCS1                         346
#define ADCS2                         347
#define WDTCON                        348
#define SWDTEN                        349
#define SWDTE                         350
#define WDTPS                         351
#define WDTPS0                        352
#define WDTPS1                        353
#define WDTPS2                        354
#define WDTPS3                        355
#define LCDCON                        356
#define LMUX0                         357
#define LMUX                          358
#define LMUX1                         359
#define CS                            360
#define CS0                           361
#define CS1                           362
#define VLCDEN                        363
#define WERR                          364
#define SLPEN                         365
#define LCDEN                         366
#define LCDPS                         367
#define LP                            368
#define LP0                           369
#define LP1                           370
#define LP2                           371
#define LP3                           372
#define WA                            373
#define LCDA                          374
#define BIASMD                        375
#define WFT                           376
#define LVDCON                        377
#define LVDL0                         378
#define LVDL                          379
#define LVDL1                         380
#define LVDL2                         381
#define LVDEN                         382
#define IRVST                         383
#define EEDATL                        384
#define EEDATL0                       385
#define EEDATL1                       386
#define EEDATL2                       387
#define EEDATL3                       388
#define EEDATL4                       389
#define EEDATL5                       390
#define EEDATL6                       391
#define EEDATL7                       392
#define EEADRL                        393
#define EEADRL0                       394
#define EEADRL1                       395
#define EEADRL2                       396
#define EEADRL3                       397
#define EEADRL4                       398
#define EEADRL5                       399
#define EEADRL6                       400
#define EEADRL7                       401
#define EEDATH                        402
#define EEDATH0                       403
#define EEDATH1                       404
#define EEDATH2                       405
#define EEDATH3                       406
#define EEDATH4                       407
#define EEDATH5                       408
#define EEADRH                        409
#define EEADRH0                       410
#define EEADRH1                       411
#define EEADRH2                       412
#define EEADRH3                       413
#define EEADRH4                       414
#define LCDDATA0                      415
#define SEG0COM0                      416
#define LCDDATA0_SEG0                 417
#define S0C0                          418
#define LCDDATA0_SEG1                 419
#define SEG1COM0                      420
#define S1C0                          421
#define LCDDATA0_SEG2                 422
#define S2C0                          423
#define SEG2COM0                      424
#define SEG3COM0                      425
#define LCDDATA0_SEG3                 426
#define S3C0                          427
#define LCDDATA0_SEG4                 428
#define SEG4COM0                      429
#define S4C0                          430
#define LCDDATA0_SEG5                 431
#define S5C0                          432
#define SEG5COM0                      433
#define SEG6COM0                      434
#define LCDDATA0_SEG6                 435
#define S6C0                          436
#define SEG7COM0                      437
#define LCDDATA0_SEG7                 438
#define S7C0                          439
#define LCDDATA1                      440
#define LCDDATA1_SEG8                 441
#define S8C0                          442
#define SEG8COM0                      443
#define LCDDATA1_SEG9                 444
#define S9C0                          445
#define SEG9COM0                      446
#define LCDDATA1_SEG10                447
#define SEG10COM0                     448
#define S10C0                         449
#define LCDDATA1_SEG11                450
#define S11C0                         451
#define SEG11COM0                     452
#define LCDDATA1_SEG12                453
#define S12C0                         454
#define SEG12COM0                     455
#define S13C0                         456
#define LCDDATA1_SEG13                457
#define SEG13COM0                     458
#define S14C0                         459
#define LCDDATA1_SEG14                460
#define SEG14COM0                     461
#define SEG15COM0                     462
#define LCDDATA1_SEG15                463
#define S15C0                         464
#define LCDDATA2                      465
#define S16C0                         466
#define SEG16COM0                     467
#define LCDDATA2_SEG16                468
#define S17C0                         469
#define LCDDATA2_SEG17                470
#define SEG17COM0                     471
#define S18C0                         472
#define SEG18COM0                     473
#define LCDDATA2_SEG18                474
#define S19C0                         475
#define SEG19COM0                     476
#define LCDDATA2_SEG19                477
#define LCDDATA2_SEG20                478
#define S20C0                         479
#define SEG20COM0                     480
#define LCDDATA2_SEG21                481
#define S21C0                         482
#define SEG21COM0                     483
#define LCDDATA2_SEG22                484
#define SEG22COM0                     485
#define S22C0                         486
#define LCDDATA2_SEG23                487
#define SEG23COM0                     488
#define S23C0                         489
#define LCDDATA3                      490
#define SEG0COM1                      491
#define LCDDATA3_SEG0                 492
#define S0C1                          493
#define LCDDATA3_SEG1                 494
#define SEG1COM1                      495
#define S1C1                          496
#define LCDDATA3_SEG2                 497
#define S2C1                          498
#define SEG2COM1                      499
#define SEG3COM1                      500
#define LCDDATA3_SEG3                 501
#define S3C1                          502
#define SEG4COM1                      503
#define LCDDATA3_SEG4                 504
#define S4C1                          505
#define LCDDATA3_SEG5                 506
#define S5C1                          507
#define SEG5COM1                      508
#define LCDDATA3_SEG6                 509
#define SEG6COM1                      510
#define S6C1                          511
#define LCDDATA3_SEG7                 512
#define SEG7COM1                      513
#define S7C1                          514
#define LCDDATA4                      515
#define S8C1                          516
#define SEG8COM1                      517
#define LCDDATA4_SEG8                 518
#define S9C1                          519
#define SEG9COM1                      520
#define LCDDATA4_SEG9                 521
