tiborsimon/embedded-tdd-headers/pic/8bit/pic16f914_tdd.h
#define LCDDATA4_SEG10                522
#define SEG10COM1                     523
#define S10C1                         524
#define LCDDATA4_SEG11                525
#define S11C1                         526
#define SEG11COM1                     527
#define LCDDATA4_SEG12                528
#define S12C1                         529
#define SEG12COM1                     530
#define S13C1                         531
#define LCDDATA4_SEG13                532
#define SEG13COM1                     533
#define S14C1                         534
#define LCDDATA4_SEG14                535
#define SEG14COM1                     536
#define SEG15COM1                     537
#define S15C1                         538
#define LCDDATA4_SEG15                539
#define LCDDATA5                      540
#define SEG16COM1                     541
#define S16C1                         542
#define LCDDATA5_SEG16                543
#define S17C1                         544
#define LCDDATA5_SEG17                545
#define SEG17COM1                     546
#define S18C1                         547
#define SEG18COM1                     548
#define LCDDATA5_SEG18                549
#define S19C1                         550
#define SEG19COM1                     551
#define LCDDATA5_SEG19                552
#define LCDDATA5_SEG20                553
#define S20C1                         554
#define SEG20COM1                     555
#define LCDDATA5_SEG21                556
#define S21C1                         557
#define SEG21COM1                     558
#define LCDDATA5_SEG22                559
#define SEG22COM1                     560
#define S22C1                         561
#define LCDDATA5_SEG23                562
#define SEG23COM1                     563
#define S23C1                         564
#define LCDDATA6                      565
#define SEG0COM2                      566
#define LCDDATA6_SEG0                 567
#define S0C2                          568
#define LCDDATA6_SEG1                 569
#define SEG1COM2                      570
#define S1C2                          571
#define LCDDATA6_SEG2                 572
#define S2C2                          573
#define SEG2COM2                      574
#define SEG3COM2                      575
#define LCDDATA6_SEG3                 576
#define S3C2                          577
#define SEG4COM2                      578
#define LCDDATA6_SEG4                 579
#define S4C2                          580
#define S5C2                          581
#define LCDDATA6_SEG5                 582
#define SEG5COM2                      583
#define SEG6COM2                      584
#define S6C2                          585
#define LCDDATA6_SEG6                 586
#define SEG7COM2                      587
#define LCDDATA6_SEG7                 588
#define S7C2                          589
#define LCDDATA7                      590
#define LCDDATA7_SEG8                 591
#define S8C2                          592
#define SEG8COM2                      593
#define S9C2                          594
#define SEG9COM2                      595
#define LCDDATA7_SEG9                 596
#define SEG10COM2                     597
#define S10C2                         598
#define LCDDATA7_SEG10                599
#define S11C2                         600
#define LCDDATA7_SEG11                601
#define SEG11COM2                     602
#define S12C2                         603
#define LCDDATA7_SEG12                604
#define SEG12COM2                     605
#define S13C2                         606
#define SEG13COM2                     607
#define LCDDATA7_SEG13                608
#define S14C2                         609
#define SEG14COM2                     610
#define LCDDATA7_SEG14                611
#define SEG15COM2                     612
#define S15C2                         613
#define LCDDATA7_SEG15                614
#define LCDDATA8                      615
#define SEG16COM2                     616
#define S16C2                         617
#define LCDDATA8_SEG16                618
#define S17C2                         619
#define LCDDATA8_SEG17                620
#define SEG17COM2                     621
#define S18C2                         622
#define SEG18COM2                     623
#define LCDDATA8_SEG18                624
#define S19C2                         625
#define SEG19COM2                     626
#define LCDDATA8_SEG19                627
#define LCDDATA8_SEG20                628
#define S20C2                         629
#define SEG20COM2                     630
#define LCDDATA8_SEG21                631
#define S21C2                         632
#define SEG21COM2                     633
#define LCDDATA8_SEG22                634
#define SEG22COM2                     635
#define S22C2                         636
#define SEG23COM2                     637
#define LCDDATA8_SEG23                638
#define S23C2                         639
#define LCDDATA9                      640
#define SEG0COM3                      641
#define LCDDATA9_SEG0                 642
#define S0C3                          643
#define SEG1COM3                      644
#define S1C3                          645
#define LCDDATA9_SEG1                 646
#define S2C3                          647
#define LCDDATA9_SEG2                 648
#define SEG2COM3                      649
#define SEG3COM3                      650
#define S3C3                          651
#define LCDDATA9_SEG3                 652
#define SEG4COM3                      653
#define LCDDATA9_SEG4                 654
#define S4C3                          655
#define S5C3                          656
#define SEG5COM3                      657
#define LCDDATA9_SEG5                 658
#define SEG6COM3                      659
#define S6C3                          660
#define LCDDATA9_SEG6                 661
#define SEG7COM3                      662
#define S7C3                          663
#define LCDDATA9_SEG7                 664
#define LCDDATA10                     665
#define S8C3                          666
#define SEG8COM3                      667
#define LCDDATA10_SEG8                668
#define S9C3                          669
#define SEG9COM3                      670
#define LCDDATA10_SEG9                671
#define SEG10COM3                     672
#define S10C3                         673
#define LCDDATA10_SEG10               674
#define S11C3                         675
#define LCDDATA10_SEG11               676
#define SEG11COM3                     677
#define S12C3                         678
#define LCDDATA10_SEG12               679
#define SEG12COM3                     680
#define S13C3                         681
#define SEG13COM3                     682
#define LCDDATA10_SEG13               683
#define S14C3                         684
#define SEG14COM3                     685
#define LCDDATA10_SEG14               686
#define SEG15COM3                     687
#define S15C3                         688
#define LCDDATA10_SEG15               689
#define LCDDATA11                     690
#define SEG16COM3                     691
#define S16C3                         692
#define LCDDATA11_SEG16               693
#define S17C3                         694
#define LCDDATA11_SEG17               695
#define SEG17COM3                     696
#define S18C3                         697
#define SEG18COM3                     698
#define LCDDATA11_SEG18               699
#define LCDDATA11_SEG19               700
#define S19C3                         701
#define SEG19COM3                     702
#define LCDDATA11_SEG20               703
#define S20C3                         704
#define SEG20COM3                     705
#define LCDDATA11_SEG21               706
#define S21C3                         707
#define SEG21COM3                     708
#define LCDDATA11_SEG22               709
#define SEG22COM3                     710
#define S22C3                         711
#define LCDDATA11_SEG23               712
#define SEG23COM3                     713
#define S23C3                         714
#define LCDSE0                        715
#define LCDSE0_SEG0                   716
#define SE0                           717
#define SEGEN0                        718
#define LCDSE0_SEG1                   719
#define SE1                           720
#define SEGEN1                        721
#define LCDSE0_SEG2                   722
#define SE2                           723
#define SEGEN2                        724
#define LCDSE0_SEG3                   725
#define SE3                           726
#define SEGEN3                        727
#define LCDSE0_SEG4                   728
#define SE4                           729
#define SEGEN4                        730
#define LCDSE0_SEG5                   731
#define SE5                           732
#define SEGEN5                        733
#define LCDSE0_SEG6                   734
#define SE6                           735
#define SEGEN6                        736
#define LCDSE0_SEG7                   737
#define SE7                           738
#define SEGEN7                        739
#define LCDSE1                        740
#define LCDSE1_SEG8                   741
#define SE8                           742
#define SEGEN8                        743
#define LCDSE1_SEG9                   744
#define SE9                           745
#define SEGEN9                        746
#define SEGEN10                       747
#define LCDSE1_SEG10                  748
#define SE10                          749
#define SEGEN11                       750
#define SE11                          751
#define LCDSE1_SEG11                  752
#define SEGEN12                       753
#define SE12                          754
#define LCDSE1_SEG12                  755
#define SEGEN13                       756
#define SE13                          757
#define LCDSE1_SEG13                  758
#define SE14                          759
#define SEGEN14                       760
#define LCDSE1_SEG14                  761
#define SE15                          762
#define SEGEN15                       763
#define LCDSE1_SEG15                  764
#define LCDSE2                        765
#define SEGEN16                       766
#define SE16                          767
#define LCDSE2_SEG16                  768
#define SEGEN17                       769
#define SE17                          770
#define LCDSE2_SEG17                  771
#define SEGEN18                       772
#define SE18                          773
#define LCDSE2_SEG18                  774
#define SEGEN19                       775
#define SE19                          776
#define LCDSE2_SEG19                  777
#define LCDSE2_SEG20                  778
#define SEGEN20                       779
#define SE20                          780
#define LCDSE2_SEG21                  781
#define SEGEN21                       782
#define SE21                          783
#define LCDSE2_SEG22                  784
#define SEGEN22                       785
#define SE22                          786
#define LCDSE2_SEG23                  787
#define SEGEN23                       788
#define SE23                          789
#define EECON1                        790
#define EERD                          791
#define RD                            792
#define EEWR                          793
#define WR                            794
#define WREN                          795
#define WRERR                         796
#define EEPGD                         797

#endif // _PIC16F914_H_
